<?php
/**
 * 新增新的基金，透過 JSON 格式新增	
 */

// JSON.stringify($("[name=selFund3] > option").map(function() {
//     var opt = {};
//     opt[$(this).val()] = $(this).text();
//     return opt;
// }).get());

require_once __DIR__.'/class/db.php';
require_once __DIR__.'/class/curl.php';

$jsonData = '[{"FTH05":"富達大中華基金"},{"FTZE9":"富達大中華基金(Y類股份累計股份-美元)"},{"FTZO8":"富達中國內需消費基金(A股累計-澳幣避險)"},{"FTZK2":"富達中國內需消費基金(Y類股份累計股份-美元)"},{"FTZK1":"富達中國內需消費基金(美元)"},{"FTZJ9":"富達中國內需消費基金(美元累積)"},{"FTZK0":"富達中國內需消費基金(歐元)"},{"FTZJ8":"富達中國內需消費基金(歐元累積)"},{"FTZE8":"富達中國聚焦基金(Y類股份累計股份-美元)"},{"FTH07":"富達中國聚焦基金(美元)"},{"FTZB9":"富達中國聚焦基金(歐元累積)"},{"FTZ10":"富達太平洋基金"},{"FTZQ9":"富達太平洋基金(A股-美元避險)"},{"FTZO9":"富達太平洋基金(A股累計-澳幣避險)"},{"FTZD1":"富達太平洋基金(Y類股份累計股份-美元)"},{"FTZ09":"富達日本小型企業基金"},{"FTZN11":"富達日本小型企業基金(A股累計-美元避險)"},{"FTZL1":"富達日本小型企業基金(A類股累計股份-日圓)"},{"FTZC8":"富達日本小型企業基金(Y類股份累計股份-日圓)"},{"FTZ08":"富達日本基金"},{"FTZN9":"富達日本基金(A股累計-美元避險)"},{"FTZL0":"富達日本基金(A類股累計股份-日圓)"},{"FTZC7":"富達日本基金(Y類股份累計股份-日圓)"},{"FTZA9":"富達日本潛力優勢基金"},{"FTZN10":"富達日本潛力優勢基金(A股累計-美元避險)"},{"FTZE4":"富達日本潛力優勢基金(Y類股份累計股份-日圓)"},{"FTZ53":"富達世界基金"},{"FTZP5":"富達世界基金(A股累計-美元)"},{"FTZP6":"富達世界基金(Y股累計-美元)"},{"FTZ24":"富達北歐基金"},{"FTZN8":"富達北歐基金(A股累計-美元避險)"},{"FTZC9":"富達北歐基金(Y類股份累計股份-瑞典克朗)"},{"FTZ56":"富達北歐基金(美元參考報價)"},{"FTZA6":"富達目標基金2020"},{"FTZM6":"富達全球入息基金(A股F1穩定月配息-美元)(本基金之配息來源可能為本金)"},{"FTZM5":"富達全球入息基金(A股F1穩定月配息-歐元)(本基金之配息來源可能為本金)"},{"FTZO1":"富達全球入息基金(A類股H月配息-澳幣避險)(本基金之配息來源可能為本金)"},{"FTZM7":"富達全球入息基金(A類股累計-美元)"},{"FTZM2":"富達全球入息基金(A類股累計-歐元避險)"},{"FTZM4":"富達全球入息基金(Y類股累計-美元)"},{"FTZM3":"富達全球入息基金(Y類股累計-歐元避險)"},{"FTZ68":"富達全球工業基金"},{"FTZE0":"富達全球工業基金(Y類股份累計股份-歐元)"},{"FTZB3":"富達全球不動產基金(美元)"},{"FTZB4":"富達全球不動產基金(歐元)"},{"FTZB2":"富達全球成長與收益基金"},{"FTZE2":"富達全球成長與收益基金(Y類股份累計股份-美元)"},{"FTZ66":"富達全球金融服務基金"},{"FTZM9":"富達全球金融服務基金(A類股-美元)"},{"FTZD9":"富達全球金融服務基金(Y類股份累計股份-歐元)"},{"FTZ62":"富達全球科技基金"},{"FTZP1":"富達全球科技基金(A股累計-美元)"},{"FTZR0":"富達全球科技基金(A股累計-美元避險)"},{"FTZD5":"富達全球科技基金(Y類股份累計股份-歐元)"},{"FTZ65":"富達全球消費行業基金"},{"FTZL5":"富達全球消費行業基金(A類股累計股份-美元)"},{"FTZD8":"富達全球消費行業基金(Y類股份累計股份-歐元)"},{"FTZK4":"富達全球高評等收益基金(A股月配息-美元)"},{"FTZK3":"富達全球高評等收益基金(美元累積)"},{"FTZ67":"富達全球健康護理基金"},{"FTZL6":"富達全球健康護理基金(A類股累計股份-美元)"},{"FTZD7":"富達全球健康護理基金(Y類股份累計股份-歐元)"},{"FTZJ0":"富達全球通膨連結債券基金(Y類股份-英鎊避險)"},{"FTZI9":"富達全球通膨連結債券基金(Y類股份累計股份-歐元避險)"},{"FTZI7":"富達全球通膨連結債券基金(美元累積)"},{"FTZI8":"富達全球通膨連結債券基金(歐元累積避險)"},{"FTZK8":"富達全球策略債券基金(Y類股份累計股份-歐元避險)"},{"FTZK5":"富達全球策略債券基金(美元累積)"},{"FTZK7":"富達全球策略債券基金(歐元累積避險)"},{"FTZK6":"富達全球策略債券基金(歐元避險)"},{"FTZ61":"富達全球電訊基金"},{"FTZJ6":"富達全球實質資產基金(Y類股份累計股份-美元)"},{"FTZJ7":"富達全球實質資產基金(Y類股份累計股份-歐元避險)"},{"FTZJ4":"富達全球實質資產基金(美元累積)"},{"FTZJ5":"富達全球實質資產基金(歐元累積避險)"},{"FTZB1":"富達全球聚焦基金"},{"FTZE3":"富達全球聚焦基金(Y類股份累計股份-美元)"},{"FTZF5":"富達全球聚焦基金(歐元)"},{"FTZG9":"富達全球優勢產業基金(Y類股份累計股份-美元)"},{"FTZG6":"富達全球優勢產業基金(美元)"},{"FTZG8":"富達全球優勢產業基金(歐元累積)"},{"FTZ19":"富達印尼基金"},{"FTZA8":"富達印度聚焦基金"},{"FTZE5":"富達印度聚焦基金(Y類股份累計股份-美元)"},{"FTZF6":"富達印度聚焦基金(歐元)"},{"FTH14":"富達亞太入息基金"},{"FTZL4":"富達亞太入息基金(A股F1穩定月配息-美元)(本基金之配息來源可能為本金)"},{"FTZP7":"富達亞太入息基金(A股H月配息-澳幣避險)(本基金之配息來源可能為本金)"},{"FTZQ4":"富達亞洲小型企業基金(A股-美元)"},{"FTZQ6":"富達亞洲小型企業基金(A股累計-美元)"},{"FTZQ7":"富達亞洲小型企業基金(A股累計-歐元)"},{"FTZQ5":"富達亞洲小型企業基金(A股-歐元)"},{"FTZQ8":"富達亞洲小型企業基金(Y股累計-美元)"},{"FTZF9":"富達亞洲成長趨勢基金(Y類股份累計股份-美元)"},{"FTZF7":"富達亞洲成長趨勢基金(美元)"},{"FTZF8":"富達亞洲成長趨勢基金(美元累積)"},{"FTZG0":"富達亞洲成長趨勢基金(歐元累積)"},{"FTZP4":"富達亞洲高收益基金(A股H月配息-澳幣避險)(本基金主要係投資於非投資等級之高風險債券且配息來源…"},{"FTZJ2":"富達亞洲高收益基金(A股穩定月配息-美元)(本基金主要係投資於非投資等級之高風險債券且配息來源可…"},{"FTZM0":"富達亞洲高收益基金(F1穩定月配息-美元)(本基金主要係投資於非投資等級之高風險債券且配息來源可…"},{"FTZR3":"富達亞洲高收益基金(I股月配息-美元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZF1":"富達亞洲高收益基金(Y類股份累計股份-美元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTH46":"富達亞洲高收益基金(美元累積)(本基金主要係投資於非投資等級之高風險債券)"},{"FTH45":"富達亞洲高收益基金(歐元累積)(本基金主要係投資於非投資等級之高風險債券)"},{"FTK08":"富達亞洲高收益基金A股-月配息(本基金主要係投資於非投資等級之高風險債券)"},{"FTZ07":"富達拉丁美洲基金"},{"FTZD2":"富達拉丁美洲基金(Y類股份累計股份-美元)"},{"FTZ13":"富達東協基金"},{"FTZP0":"富達東協基金(A股累計-澳幣避險)"},{"FTZK9":"富達東協基金(A類股累計股份-美元)"},{"FTZC2":"富達東協基金(Y類股份累計股份-美元)"},{"FTZ11":"富達東南亞基金"},{"FTZF0":"富達東南亞基金(Y類股份累計股份-美元)"},{"FTH09":"富達東南亞基金(美元累積)"},{"FTZC0":"富達東南亞基金(歐元)"},{"FTH08":"富達東南亞基金(歐元累積)"},{"FTZ28":"富達法國基金"},{"FTZ25":"富達南歐基金-歐元"},{"FTZN0":"富達美元高收益基金(A股月配息-澳幣避險)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZH1":"富達美元高收益基金(A股穩定月配息-美元)(本基金主要係投資於非投資等級之高風險債券且配息來源可…"},{"FTZL8":"富達美元高收益基金(F1穩定月配息-美元)(本基金主要係投資於非投資等級之高風險債券且配息來源可…"},{"FTZR4":"富達美元高收益基金(I股月配息-美元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZE1":"富達美元高收益基金(Y類股份累計股份-美元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZA2":"富達美元高收益基金(本基金主要係投資於非投資等級之高風險債券)"},{"FTZJ3":"富達美元高收益基金(美元累積)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZH9":"富達美元高收益基金(歐元累積)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZA3":"富達美元高收益基金A股-月配息(本基金主要係投資於非投資等級之高風險債券)"},{"FTZ55":"富達美元現金基金"},{"FTZI1":"富達美元現金基金(美元累積)"},{"FTZ33":"富達美元債券基金"},{"FTZD0":"富達美元債券基金(Y類股份累計股份-美元)"},{"FTZH8":"富達美元債券基金(美元累積)"},{"FTZ71":"富達美元債券基金A股-月配息"},{"FTZA7":"富達美國多元基金"},{"FTZ06":"富達美國成長基金"},{"FTZ05":"富達美國基金"},{"FTZM8":"富達美國基金(A類股累計-澳幣避險)"},{"FTZC1":"富達美國基金(Y類股份累計股份-美元)"},{"FTZF3":"富達美國基金(歐元)"},{"FTZ26":"富達英國基金"},{"FTZ35":"富達英鎊債券基金"},{"FTZH7":"富達英鎊債券基金(英鎊累積)"},{"FTZ18":"富達泰國基金"},{"FTZ17":"富達馬來西亞基金"},{"FTZ01":"富達國際基金"},{"FTZC6":"富達國際基金(Y類股份累計股份-美元)"},{"FTZF4":"富達國際基金(歐元)"},{"FTZ32":"富達國際債券基金"},{"FTZH6":"富達國際債券基金(美元累積)"},{"FTZ36":"富達基金II-富達美元貨幣基金"},{"FTZ38":"富達基金II-富達英鎊貨幣基金"},{"FTZ40":"富達基金II-富達歐元貨幣基金"},{"FTZ42":"富達基金II-富達澳元貨幣基金"},{"FTZ16":"富達新加坡基金"},{"FTZ02":"富達新興市場基金"},{"FTZL2":"富達新興市場基金(A類股累計股份-美元)"},{"FTZE7":"富達新興市場基金(Y類股份累計股份-美元)"},{"FTZF2":"富達新興市場基金(歐元)"},{"FTZN1":"富達新興市場債券基金(A類股月配息-澳幣避險)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZM1":"富達新興市場債券基金(F1穩定月配息-美元)(本基金主要係投資於非投資等級之高風險債券且配息來源…"},{"FTZE6":"富達新興市場債券基金(Y類股份累計股份-美元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZB5":"富達新興市場債券基金(美元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZH3":"富達新興市場債券基金(美元累積)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZB6":"富達新興市場債券基金(歐元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZH2":"富達新興市場債券基金(歐元累積)(本基金主要係投資於非投資等級之高風險債券)"},{"FTK10":"富達新興市場債券基金A股月配息-美元(本基金主要係投資於非投資等級之高風險債券)"},{"FTK09":"富達新興市場債券基金A股月配息-歐元(本基金主要係投資於非投資等級之高風險債券)"},{"FTZI6":"富達新興亞洲基金(Y類股份累計股份-美元)"},{"FTZI2":"富達新興亞洲基金(美元)"},{"FTZI4":"富達新興亞洲基金(美元累積)"},{"FTZI3":"富達新興亞洲基金(歐元)"},{"FTZI5":"富達新興亞洲基金(歐元累積)"},{"FTZH0":"富達新興歐非中東基金(Y類股份累計股份-美元)"},{"FTZG3":"富達新興歐非中東基金(美元)"},{"FTZG4":"富達新興歐非中東基金(美元累積)"},{"FTZG1":"富達新興歐非中東基金(歐元)"},{"FTZG2":"富達新興歐非中東基金(歐元累積)"},{"FTZ30":"富達瑞士基金"},{"FTZ29":"富達義大利基金"},{"FTZ27":"富達德國基金"},{"FTZO7":"富達德國基金(A股累計-美元避險)"},{"FTZQ1":"富達歐元公司債基金(A股月配息-歐元)"},{"FTZP9":"富達歐元公司債基金(A股累計-歐元)"},{"FTZQ0":"富達歐元公司債基金(A股-歐元)"},{"FTZQ2":"富達歐元公司債基金(Y股累計-歐元)"},{"FTZB7":"富達歐元目標TM基金2025"},{"FTZB8":"富達歐元目標TM基金2030"},{"FTZ54":"富達歐元現金基金"},{"FTZI0":"富達歐元現金基金(歐元累積)"},{"FTZ34":"富達歐元債券基金"},{"FTZ72":"富達歐元債券基金(A股月配息-歐元)"},{"FTZP3":"富達歐元債券基金(A股累計-美元避險)"},{"FTZC4":"富達歐元債券基金(Y類股份累計股份-歐元)"},{"FTZH4":"富達歐元債券基金(歐元累積)"},{"FTZ59":"富達歐元藍籌基金"},{"FTZN4":"富達歐元藍籌基金(A股累計-美元避險)"},{"FTZO4":"富達歐洲入息基金(A股F1穩定月配息-美元避險)(本基金之配息來源可能為本金)"},{"FTZO3":"富達歐洲入息基金(A股F1穩定月配息-歐元)(本基金之配息來源可能為本金)"},{"FTZP8":"富達歐洲入息基金(A股H月配息-澳幣避險)(本基金之配息來源可能為本金)"},{"FTZO5":"富達歐洲入息基金(A股累計-歐元)"},{"FTZO2":"富達歐洲入息基金(A股-歐元)"},{"FTZO6":"富達歐洲入息基金(Y股累計-歐元)"},{"FTZB0":"富達歐洲大型企業基金"},{"FTZN2":"富達歐洲大型企業基金(Y類股-歐元)"},{"FTZ23":"富達歐洲小型企業基金"},{"FTZN7":"富達歐洲小型企業基金(A股累計-美元避險)"},{"FTZD3":"富達歐洲小型企業基金(Y類股份累計股份-歐元)"},{"FTZ31":"富達歐洲平衡基金"},{"FTZP2":"富達歐洲平衡基金(A股累計-美元避險)"},{"FTZR1":"富達歐洲高收益基金(A股H月配息-澳幣避險)(本基金主要係投資於非投資等級之高風險債券且配息來源…"},{"FTZL7":"富達歐洲高收益基金(A股月配息-美元避險)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZJ1":"富達歐洲高收益基金(A股穩定月配息-歐元)(本基金主要係投資於非投資等級之高風險債券且配息來源可…"},{"FTZL3":"富達歐洲高收益基金(A類股累計股份-美元避險)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZL9":"富達歐洲高收益基金(F1穩定月配息-歐元)(本基金主要係投資於非投資等級之高風險債券且配息來源可…"},{"FTZR5":"富達歐洲高收益基金(I股月配息-美元避險)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZR2":"富達歐洲高收益基金(Y股累計-美元避險)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZD6":"富達歐洲高收益基金(Y類股份累計股份-歐元)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZ69":"富達歐洲高收益基金(本基金主要係投資於非投資等級之高風險債券)"},{"FTZH5":"富達歐洲高收益基金(歐元累積)(本基金主要係投資於非投資等級之高風險債券)"},{"FTZ70":"富達歐洲高收益基金A股月配息(本基金主要係投資於非投資等級之高風險債券)"},{"FTZA1":"富達歐洲動能基金"},{"FTZN5":"富達歐洲動能基金(A股累計-美元避險)"},{"FTZQ3":"富達歐洲動能基金(Y股累計-歐元)"},{"FTZN3":"富達歐洲動能基金(Y類股-歐元)"},{"FTZN6":"富達歐洲基金(A股累計-美元避險)"},{"FTZC3":"富達歐洲基金(Y類股份累計股份-歐元)"},{"FTZ22":"富達歐洲基金A歐元"},{"FTZ60":"富達歐盟50TM基金"},{"FTZ14":"富達澳洲基金"},{"FTZ20":"富達韓國基金"}]';
$jsonData = json_decode($jsonData);

foreach ($jsonData as $value) {
	$fundeName = key($value);
	$fundName = $value->$fundeName;
	// 抓股票型基金
	if ( ! check_class($fundeName) ) {
		continue;
	}

	$stmt = $db->prepare("INSERT INTO category (fundName, fundeName) VALUES (?, ?)");
	$stmt->execute([$fundName, $fundeName]);

	$data = spide($fundeName);
	$dates = $data['dates'];
	$values = $data['values'];
	// $spacePosition = strpos($data, ' ');
	// $dates = substr($data, 0, $spacePosition);
	// $values = substr($data, $spacePosition, strlen($data));
	// $dates = explode(',', $dates);
	// $values = explode(',', $values);

	foreach ($dates as $key => $a) {
		// echo $values[$key];
		$stmt = $db->prepare("INSERT INTO price (fundName, fundeName, price, date) VALUES (?, ?, ?, ?)");
		$stmt->execute([
			$fundName,
			$fundeName,
			$values[$key],
			$dates[$key]
		]);
	}
	echo $fundeName . " finish. \n";
}